{
  "_name_or_path": "stanghong/leaf-disease-id",
  "architectures": [
    "ViTForImageClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "encoder_stride": 16,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "Anthracnose",
    "1": "Leaf Blight: ",
    "2": "Leaf Rust",
    "3": "leaf Black Spot",
    "4": "leaf Powdery Mildew"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "Anthracnose": "0",
    "Leaf Blight: ": "1",
    "Leaf Rust": "2",
    "leaf Black Spot": "3",
    "leaf Powdery Mildew": "4"
  },
  "layer_norm_eps": 1e-12,
  "model_type": "vit",
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.38.2"
}
